{
  "title": "发信hr骚扰",
  "cells": [
    {
      "type": "text",
      "data": "<h2 style=\"font-size: 13px;\"><br></h2>"
    },
    {
      "type": "text",
      "data": "<div>My name is Zhengbin, I am grad student in Santa Clara university,my major is computer science and engineering. I am currently looking for software engineering jobs and will graduate in March 2016.if the internship position can accept grad student after graduate, it’s also ok for me.&nbsp;</div><div><br></div><div>I’ve gained extensive experience in all aspects of software engineering, Before beginning my studies at Santa University, I interned as a software engineer with NEC software in Beijing, China. During that period, I implemented several technologies such as Spring, Struts. Through classes and my own projects, I have also gained experience in: Java, data structure and algorithms, JavaScript, Html5. CSS3,now I am focusing on the web development (MEAN stack ).&nbsp;<br></div><div><br></div><div>What’s more, one of my major strengths is that I work very hard and continually look for ways to provide the highest quality &nbsp;to complete the work. &nbsp;I am self-motivated and enjoy working in a team environment and also set up high goals and I've been told that I'm persistent. I’m looking for an opportunity to work for a growing company where I can contribute my hands-on experience and grow my career with the company.&nbsp;<br></div><div><br></div><div>My resume is attached. If you have any open positions that you believe are a good match for me, please feel free to contact me. Thank you very much!<br></div><div><br></div>"
    },
    {
      "type": "text",
      "data": ""
    },
    {
      "type": "text",
      "data": "Linkedin 骚扰"
    },
    {
      "type": "text",
      "data": "<br>"
    },
    {
      "type": "text",
      "data": ""
    },
    {
      "type": "text",
      "data": "<div>Hi Mike,</div><div>My name is Zhengbin, I am grad student in Santa Clara university，my major is computer science and engineering. I am currently looking for software engineering jobs and will graduate in March 2016.&nbsp;</div><div><br></div><div>Through classes and my own projects, I have also gained experience in: Java, data structure and algorithms, JavaScript, Html5. CSS3,now I am focusing on the web development (MEAN stack ).&nbsp;</div><div><br></div><div>&nbsp;I’m looking for an opportunity to work for a growing company where I can contribute my hands-on experience and grow my career with the company.&nbsp;</div><div><br></div><div>&nbsp;If you have any open positions that you believe are a good match for me, please feel free to contact me. Thank you very much!</div><div><br></div><div>Best Gards,</div><div>Zhengbin Luo</div><div>robinluo2015@gmail.com</div><div>408-334-0017</div>"
    },
    {
      "type": "text",
      "data": "<div>Hi Jesse,</div><div>My name is Zhengbin, I am grad student in Santa Clara university，my major is computer science and engineering. I am currently looking for software engineering jobs and will graduate in March 2016.&nbsp;</div><div><br></div><div>Through classes and my own projects, I have also gained experience in: Java, data structure and algorithms, JavaScript, Html5. CSS3,now I am focusing on the web development.&nbsp;</div><div><br></div><div>&nbsp;I’m looking for an opportunity to work for yahoo where I can contribute my hands-on experience and grow my career with such great company.&nbsp;</div><div><br></div><div>&nbsp;If you have any open positions that you believe are a good match for me, please feel free to contact me. Thank you very much!</div><div><br></div><div>Best Gards,</div><div>Zhengbin Luo</div><div>robinluo2015@gmail.com</div><div>408-334-0017</div>"
    }
  ]
}